/*
Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.
m = 3, n = 4.
0,5 7 -2 -0,2
1 -3,3 8 -9,9
8 7,8 -7,1 9
 */

//генерация массива

double[,] GenerateArrayIJ(int rows = 3, int cols = 4, int start = -10, int end = 10)
{
    double[,] array = new double[rows, cols];
    Random random = new Random();
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = Math.Round(random.NextDouble() * (start - end) + end, 2);
        }
    }

    return array;
}

void PrintArrayIJ(double[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
        Console.WriteLine();
    }
}


//Чтение данных из консоли
Console.Write("Введите количество строк для генерации массива: ");
int rows = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите количество столбцов для генерации массива: ");
int cols = Convert.ToInt32(Console.ReadLine());

double[,] userArray = GenerateArrayIJ(rows, cols);

PrintArrayIJ(userArray);